In [9]:
import pandas as pd
import numpy as np

In [3]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [14]:
ufo

,City,Colors Reported,Shape Reported,State,Time,rnd
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00,2
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00,39
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00,78
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00,83
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00,66
...,...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00,46
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00,29
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00,17
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00,51
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00,62

In [5]:
ufo['Time'] = pd.to_datetime(ufo.Time)

In [6]:
ufo.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18241 entries, 0 to 18240
Data columns (total 5 columns):
City               18216 non-null object
Colors Reported    2882 non-null object
Shape Reported     15597 non-null object
State              18241 non-null object
Time               18241 non-null datetime64[ns]
dtypes: datetime64[ns](1), object(4)
memory usage: 712.7+ KB

In [7]:
ufo.Time.dt.quarter

0        2
1        2
2        1
3        2
4        2
        ..
18236    4
18237    4
18238    4
18239    4
18240    4
Name: Time, Length: 18241, dtype: int64

In [13]:
ufo['rnd'] = np.random.randint(1,100, len(ufo))

In [18]:
ufo['quarter'] = ufo.Time.dt.quarter
ufo['year'] = ufo.Time.dt.year

In [19]:
ufo.groupby(['year','quarter']).agg({'rnd':'sum'})

                rnd
year quarter
1930 2           41
1931 1           78
     2           83
1933 2           66
1934 3           44
...             ...
1999 4        44351
2000 1        28405
     2        28064
     3        41879
     4        33188

[244 rows x 1 columns]

In [29]:
dt = pd.to_datetime('2019-08-27 03:58:27,718',utc=True)

In [30]:
dt.microsecond

718000